app/app/Controllers/Login.php

SELECT *
FROM `users`
WHERE `email` = 'coba@mail.com'
---
                          ];

                          $userModel->where("email", $email);
                          $profile = $userModel->get()->getResultArray();

SELECT COUNT(*) AS `numrows`
FROM `users`
---
              }

            //view login/signup
        if ($userModel->CountAllResults() > 0){