home/app/Controllers/DocReport.php

    public function getPurchaseOrder()
    {
        $startDate = $this->request->getGet('start_date');
        $endDate = $this->request->getGet('end_date');
        $status = $this->request->getGet('status');
        $supplier = $this->request->getGet('supplier');

        $builder = $this->models['purchase_order'];

        // Filter data
        if ($startDate && $endDate) {
            $builder->where('date >=', $startDate)
                   ->where('date <=', $endDate);
        }

        if ($status && $status != 'all') {
            $builder->where('status', $status);
        }

        if ($supplier) {
            $builder->where('supplier_id', $supplier);
        }

        $data = $builder->select('purchase_order.*, supplier.supplier_name')
                       ->join('supplier', 'supplier.id = purchase_order.supplier_id')
                       ->orderBy('purchase_order.date', 'DESC')
                       ->orderBy('purchase_order.code', 'ASC')
                       ->findAll();
---
SELECT `purchase_order`.*, `supplier`.`supplier_name`
FROM `purchase_order`
JOIN `supplier` ON `supplier`.`id` = `purchase_order`.`supplier_id`
ORDER BY `purchase_order`.`date` DESC, `purchase_order`.`code` ASC

    public function getGoodReceivedNote()
    {
        $startDate = $this->request->getGet('start_date');
        $endDate = $this->request->getGet('end_date');
        $status = $this->request->getGet('status');
        $supplier = $this->request->getGet('supplier');

        $builder = $this->models['pembelian'];

        if ($startDate && $endDate) {
            $builder->where('tanggal_nota >=', $startDate)
                   ->where('tanggal_nota <=', $endDate);
        }

        if ($status && $status != 'all') {
            // Sesuaikan dengan field status di tabel pembelian
            $builder->where('status_pembayaran', $status);
        }

        if ($supplier) {
            $builder->where('id_supplier', $supplier);
        }

        $data = $builder->select('pembelian.*, supplier.supplier_name')
                       ->join('supplier', 'supplier.id = pembelian.id_supplier')
                       ->orderBy('pembelian.tanggal_nota', 'DESC')
                       ->orderBy('pembelian.invoice', 'ASC')
                       ->findAll();
---
SELECT `pembelian`.*, `supplier`.`supplier_name`
FROM `pembelian`
JOIN `supplier` ON `supplier`.`id` = `pembelian`.`id_supplier`
ORDER BY `pembelian`.`tanggal_nota` DESC, `pembelian`.`invoice` ASC

    public function getFilterOptions($type)
    {
        switch ($type) {
            case 'suppliers':
                $supplierModel = new \App\Models\MdlSupplier();
                $data = $supplierModel->select('id, supplier_name as text')
                                    ->where('status', 1)
                                    ->orderBy('supplier_name', 'ASC')
                                    ->findAll();
                break;

            case 'customers':
                $customerModel = new \App\Models\MdlCustomer();
                $data = $customerModel->select('id, customer_name as text')
                                    ->where('status', 1)
                                    ->orderBy('customer_name', 'ASC')
                                    ->findAll();
                break;

            case 'departments':
                $departmentModel = new \App\Models\MdlDepartment();
                $data = $departmentModel->select('id, name as text')
                                      ->orderBy('name', 'ASC')
                                      ->findAll();
---
SELECT `id`, `supplier_name` as `text`
FROM `supplier`
WHERE `status` = 1
ORDER BY `supplier_name` ASC
SELECT `id`, `customer_name` as `text`
FROM `customer`
WHERE `status` = 1
ORDER BY `customer_name` ASC
SELECT `id`, `name` as `text`
FROM `department`
ORDER BY `name` ASC