home/app/Controllers/ProductController.php

SELECT *
FROM `product`
---
    public function getProduct()
    {
           $MdlProduct = new \App\Models\MdlProduct();

    $product = $MdlProduct->findAll();