app/app/Models/MdlUser.php

  function get_cipherpass($email){
    return $this->where('email',$email)->first('id','password','email','level','nama_depan','nama_belakang');
---
SELECT *
FROM `users`
WHERE `email` = 'coba@mail.com'
 LIMIT 1