app/Controllers/DashboardController.php

    function getCurrencyData(){

        $mdl = new \App\Models\MdlCurrency();
        $data = $mdl->findAll();
---
SELECT *
FROM `currency`